Documents/Тур.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>Тур</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.Игры</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СыграноИгр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерТура</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Игры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Хозяин</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Гость</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Команды</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Счет</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>4</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сыгран</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МЗ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>МП</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>2</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/Игры.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<AccumulationRegister>
		<Properties>
			<Name>Игры</Name>
			<RegisterType>Turnovers</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Счет</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Выигр</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Ничьи</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пораж</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МЗ</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МП</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Очки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПОчки</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сезон</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сезоны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Страна</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Страны</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Тур</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>2</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Дата</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>Кто</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>СКем</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Команды</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ГдеИгра</Name>
					<Comment>1 - дома 2 - выезд</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/Тур/Ext/ObjectModule.bsl
Перем _В, _Н, _П, _О, _ПО;

Процедура ОбнулитьРеквизиты()
	_В = 0; _Н = 0; _П = 0; _О = 0; _ПО = 0;
КонецПроцедуры  

Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	
	Движения.Игры.Записывать = Истина;
	
	СыграноИгр = 0;
	
	ТекГод = Год(Дата);       
	
	//Сезон = Справочники.Сезоны.НайтиПоКоду(Формат(ТекГод, "ЧГ=")); 
	
	// Саша комментарий начало дата от 20.06.2025 9:43:19
	// пока закоментим сами будем заполнять Сезон
	
	//	Сезон = Константы.ТекущийСезон.Получить();   	
	// Саша комментарий конец дата от 20.06.2025 9:43:19       
	
	//Очки как получают
	
	Если ТекГод < 1995 Тогда
		ОчковЗаПобеду = 2;
		ПотерОчковЗаНичью = 1
	Иначе	
		ОчковЗаПобеду = 3;
		ПотерОчковЗаНичью = 2
	КонецЕсли;     
	
	//Очки как получают
	
	
	Для Каждого ТекСтрокаИгры Из Игры Цикл
		
		// регистр Игры Приход
		Для йй = 1 По 2 Цикл
			
			Движ = Движения.Игры.Добавить();
			
			Движ.Период	= Дата; //1 Тут надо дату сезона ставить будет
			Движ.Сезон	= Сезон; // 2
			//Движ.Страна	= Константы.ТекущаяСтрана.Получить();
			Движ.Дата	= ТекСтрокаИгры.Дата; // 3
			Движ.Тур		= Число(Номер);   // 4
			
			К1			= ТекСтрокаИгры.Хозяин; // 5
			К2			= ТекСтрокаИгры.Гость;  // 6
			
			Если йй=2 Тогда Врм = К1; К1 = К2; К2 = Врм; 
				
			КонецЕсли;
			
			Движ.Кто		= К1;
			Движ.СКем	    = К2;
			Движ.ГдеИгра    = йй;
			
			Если ТекСтрокаИгры.Сыгран Тогда // будут и цифры
				МЗ = ТекСтрокаИгры.МЗ;
				МП = ТекСтрокаИгры.МП;
				
				Если йй=2 Тогда Врм = МЗ; МЗ = МП; МП = Врм; 
					
				КонецЕсли;
				
				Движ.МЗ = МЗ; Движ.МП = МП;
				
				ОбнулитьРеквизиты();
				Если МЗ > МП Тогда
					_В = 1; _О = ОчковЗаПобеду;
				ИначеЕсли МЗ=МП	Тогда
					_Н = 1; _О = 1; _ПО = ПотерОчковЗаНичью;
				Иначе
					_П = 1; _ПО = ОчковЗаПобеду;
				КонецЕсли;
				
				Движ.Выигр = _В;
				Движ.Ничьи = _Н;
				Движ.Пораж = _П;
				
				Движ.МЗ = МЗ; Движ.МП = МП;
				
				Движ.Очки = _О;
				Движ.ПОчки = _ПО;
				
				Если МЗ=0 И МП=0 Тогда
					Движ.Счет = 99 
				Иначе
					Движ.Счет = МЗ*10+МП	
				КонецЕсли;
			КонецЕсли;
			
		КонецЦикла;
		
		// подсчет количества сыгранных игр
		СыграноИгр = СыграноИгр + ?(ТекСтрокаИгры.Сыгран, 1, 0);
		
	КонецЦикла;
	
	ЭтотОбъект.Записать();	// либо подсч. кол-во игр в форме документа
	
КонецПроцедуры


//Процедура ОбработкаПроведения(Отказ, РежимПроведения)
//	
//	Движения.Игры.Записывать = Истина;
//	
//	СыграноИгр = 0;
//	
//	ТекГод = Год(Дата);       
//	
//	//Сезон = Справочники.Сезоны.НайтиПоКоду(Формат(ТекГод, "ЧГ=")); 
//	
//	// Саша комментарий начало дата от 20.06.2025 9:43:19
//	// пока закоментим сами будем заполнять Сезон
//	
//	//	Сезон = Константы.ТекущийСезон.Получить();   	
//	// Саша комментарий конец дата от 20.06.2025 9:43:19       
//	
//	//Очки как получают
//	
//	Если ТекГод < 1995 Тогда
//		ОчковЗаПобеду = 2;
//		ПотерОчковЗаНичью = 1
//	Иначе	
//		ОчковЗаПобеду = 3;
//		ПотерОчковЗаНичью = 2
//	КонецЕсли;     
//	
//	//Очки как получают
//	
//	
//	Для Каждого ТекСтрокаИгры Из Игры Цикл
//		
//		// регистр Игры Приход
//		Для йй = 1 По 2 Цикл
//			
//			Движ = Движения.Игры.Добавить();
//			
//			Движ.Период	= Дата; //1 Тут надо дату сезона ставить будет
//			Движ.Сезон	= Сезон; // 2
//			//Движ.Страна	= Константы.ТекущаяСтрана.Получить();
//			Движ.Дата	= ТекСтрокаИгры.Дата; // 3
//			Движ.Тур		= Число(Номер);   // 4
//			
//			К1			= ТекСтрокаИгры.Хозяин; // 5
//			К2			= ТекСтрокаИгры.Гость;  // 6
//			
//			Если йй=2 Тогда Врм = К1; К1 = К2; К2 = Врм; 
//				
//			КонецЕсли;
//			
//			Движ.Кто		= К1;
//			Движ.СКем	    = К2;
//			Движ.ГдеИгра    = йй;
//			
//			Если ТекСтрокаИгры.Сыгран Тогда // будут и цифры
//				МЗ = ТекСтрокаИгры.МЗ;
//				МП = ТекСтрокаИгры.МП;
//				
//				Если йй=2 Тогда Врм = МЗ; МЗ = МП; МП = Врм; 
//					
//				КонецЕсли;
//				
//				Движ.МЗ = МЗ; Движ.МП = МП;
//				
//				ОбнулитьРеквизиты();
//				Если МЗ > МП Тогда
//					_В = 1; _О = ОчковЗаПобеду;
//				ИначеЕсли МЗ=МП	Тогда
//					_Н = 1; _О = 1; _ПО = ПотерОчковЗаНичью;
//				Иначе
//					_П = 1; _ПО = ОчковЗаПобеду;
//				КонецЕсли;
//				
//				Движ.Выигр = _В;
//				Движ.Ничьи = _Н;
//				Движ.Пораж = _П;
//				
//				Движ.МЗ = МЗ; Движ.МП = МП;
//				
//				Движ.Очки = _О;
//				Движ.ПОчки = _ПО;
//				
//				Если МЗ=0 И МП=0 Тогда
//					Движ.Счет = 99 
//				Иначе
//					Движ.Счет = МЗ*10+МП	
//				КонецЕсли;
//			КонецЕсли;
//			
//		КонецЦикла;
//		
//		// подсчет количества сыгранных игр
//		СыграноИгр = СыграноИгр + ?(ТекСтрокаИгры.Сыгран, 1, 0);
//		
//	КонецЦикла;
//	
//	ЭтотОбъект.Записать();	// либо подсч. кол-во игр в форме документа
//	
//КонецПроцедуры
